app/views/api/books/index.json.jbuilder

SELECT  "bookshelves".* FROM "bookshelves" WHERE "bookshelves"."user_id" = $1 ORDER BY "bookshelves"."id" ASC LIMIT $2  [["user_id", 23], ["LIMIT", 1]]
---
        json.extract! book, :id, :title, :description, :author, :published_date, :pages, :image
        json.bookshelves book.bookshelves.where(user_id: current_user.id)