app/controllers/api/bookshelf_controller.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "hPHtP4N35O7gzoojt3vkjg"], ["updated_at", "2019-04-01 19:24:51.966777"], ["id", 17]]
INSERT INTO "bookshelves" ("user_id", "title") VALUES ($1, $2) RETURNING "id"  [["user_id", 17], ["title", "Read"]]
INSERT INTO "bookshelves" ("user_id", "title") VALUES ($1, $2) RETURNING "id"  [["user_id", 17], ["title", "Current Read"]]
INSERT INTO "bookshelves" ("user_id", "title") VALUES ($1, $2) RETURNING "id"  [["user_id", 17], ["title", "Want to Read"]]
INSERT INTO "bookshelves" ("user_id", "title") VALUES ($1, $2) RETURNING "id"  [["user_id", 4], ["title", "Want to Read"]]
---
    def index
        #no id for when current user is nil

        @bookshelves = Bookshelf.where(user_id: current_user.id)
        # debugger
        if @bookshelves.first === nil
            # debugger
            Bookshelf.new({user_id: current_user.id, title: "All"}).save;
            Bookshelf.new({user_id: current_user.id, title: "Read"}).save;
            Bookshelf.new({user_id: current_user.id, title: "Current Read"}).save;
            Bookshelf.new({user_id: current_user.id, title: "Want to Read"}).save;