app/controllers/api/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    # you only want the books associated with the bookshelf_id
    if params[:bookshelfId]

      @bookshelf = Bookshelf.find_by(id: Integer(params[:bookshelfId]) )

      @books = @bookshelf.books
    else
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show

    @book = Book.find_by(id: params[:id])