app/views/api/users/show.json.jbuilder

json.bookshelves do
  @user.bookshelves.each do |bookshelf|
---
SELECT "bookshelves".* FROM "bookshelves" WHERE "bookshelves"."user_id" = $1  [["user_id", 23]]